import random as r

txtName = "10w.u"

f = open(txtName, "w")

check = []

names_a = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许',
           '姚', '邵', '堪', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
           '熊', '纪', '舒', '屈', '项', '祝', '董', '梁', '张', '金']

names_b = ['玉', '明', '龙', '芳', '军', '玲', '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨',
           '朱', '秦', '尤', '许',
           '姚', '邵', '堪', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
           '熊', '纪', '舒', '屈', '项', '祝', '董', '梁', '张', '金', '阿', '大', '小', '光', '晓']
names_c = ['玉', '', '明', '龙', '芳', '军', '玲', '赵', '钱', '孙', '李', '周', '吴', '', '郑', '', '王', '冯', '', '陈', '褚', '卫',
           '蒋', '', '沈', '韩', '杨', '朱', '秦', '尤', '许',
           '姚', '邵', '堪', '汪', '祁', '毛', '禹', '', '狄', '米', '贝', '明', '', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
           '熊', '纪', '舒', '屈', '项', '', '祝', '董', '梁', '', '张', '', '金', '阿', '', '大', '小', '光', '晓']

hobby = ['旅行', '摄影', '音乐', '电子游戏', '篮球', '足球', '乒乓球', '手球', '钢琴', '吉他', '人声', '代码', '学习', '阅读', '吃', '户外', '跑步', '旅游',
         '羽毛球', '电影', '跳舞', '跳高', '跳远',
         '茶道', '插花', '绘画', '书法', '电视剧', '相声', '小品', '音乐剧', '购物', '时尚', '明星', '铅球', '三级跳', '游泳', '跳绳', '跳水', '潜水', '驾驶',
         '极限运动']

i = 1
while i <= 100000:
    name = r.choice(names_a) + r.choice(names_b) + r.choice(names_c)
    
    if name not in check:   
        info =  name+ "," + r.choice(hobby) + "," + str(r.randint(1,80)) + ";" + str(r.randint(1, 2)) + "\n"
        check.append(name)
        f.write(info)
        i= i+1
        print(i)

f.close()
